package random;


public class Randoming {
	public static String[][] quiz =  new String[40][6];
	public static String[][] result = new String[15][6];
	public static String[][] finalresult = new String[15][3];
	public static int[] random = new int[15];
	public static int count = 0;
	public static int countforpage = 0;
	public static double resultforanalysis = 2;
	public  static void getRandomString() {
		
		for(int j = 0; j< 15;j++) {
		int a = (int)(Math.random()* 40);
		while(!testrandom(a))
			a = (int)(Math.random() * 40);
		 result[j] = quiz[a];
		}
		
	
	
		
	}
	
	public static boolean testrandom(int a) {
		for(int i = 0; i < count; i++) {
			if(a == random[i])
				return false;
		}
		
		random[count] = a;
		count++;
		return true;
	}
	
	public static int getResult() {
		int result = 0;
		for(int i = 0; i < 15; i++) {
			if(finalresult[i][1].equals(finalresult[i][2]))
				result++;
		}
		return result;
	}
	
	public static void getInitialize() {
		quiz[0][0]="Vitamin D မပါဝင္ေသာ အစားအစာမွာ -";
		quiz[0][1]="မိႈ";
		quiz[0][2]="တိုဖူ";
		quiz[0][3]="ငါးဥဆားနယ္";
		quiz[0][4]="ကိုက္လန္";
		quiz[0][5]="ကိုက္လန္";

		quiz[1][0]="လူ႔ခႏၶာကိုယ္၌ လက္ ေဗ ြရာ ကဲ့သို႔ေသာ ေဗ ြရာပါသည့္အျခားအစိတ္အပိုင္းတစ္ခုမွာ-";
		quiz[1][1]="ႏွာေခါင္း";
		quiz[1][2]="လွ်ာ";
		quiz[1][3]="တံေတာင္ဆစ္";
		quiz[1][4]="ေျခ ေခ်ာင္း";
		quiz[1][5]="လွ်ာ";

		quiz[2][0]="လူတစ္ဦး မတ္တပ္ရပ္လ်ွင္ ၾက ြက္သားအ ေရအတ ြက္မည္မ်ွကိုအသံုးျပဳသနည္း။";
		quiz[2][1]="100";
		quiz[2][2]="200";
		quiz[2][3]="300";
		quiz[2][4]="400";
		quiz[2][5]="300";

		quiz[3][0]="လူတစ္ဦး ျပံဳးေသာအခါ ၾက ြက္သား အ ေရအတ ြက္ မည္မ်ွကို အသံုးျပဳသနည္း။";
		quiz[3][1]="15";
		quiz[3][2]="16";
		quiz[3][3]="17";
		quiz[3][4]="18";
		quiz[3][5]="17";

		quiz[4][0]="လူတစ္ဦး မဲ့ေသာအခါ ၾက ြက္သား အ ေရအတ ြက္ မည္မ်ွကို အသံုးျပဳသနည္း။";
		quiz[4][1]="42";
		quiz[4][2]="43";
		quiz[4][3]="44";
		quiz[4][4]="45";
		quiz[4][5]="43";

		quiz[5][0]="မည္သည့္လက္ ေခ်ာင္း၏ လက္သည္းသည္ ႐ွည္လ်ားမႈ အ ေႏွးဆံုးျဖစ္သနည္း။";
		quiz[5][1]="လက္မ";
		quiz[5][2]="လက္ညိဳး";
		quiz[5][3]="လက္ခလယ္";
		quiz[5][4]="လက္သန္းၾက ြယ္";
		quiz[5][5]="လက္မ";

		quiz[6][0]="Vitamin C မပါေသာ အစားအစာမွာ";
		quiz[6][1]="င႐ုတ္ေကာင္း";
		quiz[6][2]="ကီဝီသီး";
		quiz[6][3]="ခရမ္းခ်ဥ္သီး";
		quiz[6][4]="သစ္ၾကားသီး";
		quiz[6][5]="သစ္ၾကားသီး";

		quiz[7][0]="အ႐ိုးက်န္းမာေရးအတ ြက္ ေကာင္းမ ြန္ေသာ Vitamin မွာ";
		quiz[7][1]="Vitamin A";
		quiz[7][2]="Vitamin B";
		quiz[7][3]="Vitamin C";
		quiz[7][4]="Vitamin D";
		quiz[7][5]="Vitamin D";

		quiz[8][0]="ကမာ ၻေပၚတ ြင္ ပ်မ္းမွ်အားျဖင့္ -------------    မိနစ္တုိင္းတ ြင္ ဦး ေႏွာက္ ေသ ြး ေၾကာပ်က္၍ လူတစ္ဦးေသဆံုးေနပါသည္။";
		quiz[8][1]="2 - 3 မိနစ္";
		quiz[8][2]="3 - 4 မိနစ္";
		quiz[8][3]="4 - 5 မိနစ္";
		quiz[8][4]="5 - 6 မိနစ္";
		quiz[8][5]="3 - 4 မိနစ္";

		quiz[9][0]="ေရခဲမုန္႔စားျခင္းေၾကာင့္ ေခါင္းကိုက္ႏိုင္ေသာ ရာခိုင္ႏႈန္းမွာ";
		quiz[9][1]="10%";
		quiz[9][2]="20%";
		quiz[9][3]="30%";
		quiz[9][4]="40%";
		quiz[9][5]="40%";

		quiz[10][0]="ေခါင္းကိုက္သက္သာေစရန္ ေအာက္ပါတို႔မွ မည္သည့္အရာကို ေသာက္သံုးသင့္သနည္း။";
		quiz[10][1]="ေရ";
		quiz[10][2]="Black Coffee";
		quiz[10][3]="Beer";
		quiz[10][4]="ႏြားႏို႔";
		quiz[10][5]="ေရ";

		quiz[11][0]="စိတ္က် ေရာဂါေဝဒနာ ခံစားေနရခ်ိန္တ ြင္ မည္သည့္အစားအေသာက္ကို ေ႐ွာင္ၾကဥ္ရမည္နည္း။";
		quiz[11][1]="အသီးအရ ြက္";
		quiz[11][2]="ႏို႔ထ ြက္ပစၥည္းမ်ား";
		quiz[11][3]="အခ်ိဳရည္မ်ား";
		quiz[11][4]="ငါးႏွင့္အခံ ြမာသီးမ်ား";
		quiz[11][5]="အခ်ိဳရည္မ်ား";

		quiz[12][0]="လူ႔ခႏၶာကိုယ္တ ြင္ ေရဓာတ္ ------------- ပါဝင္ပါသည္။";
		quiz[12][1]="23%";
		quiz[12][2]="37%";
		quiz[12][3]="44%";
		quiz[12][4]="61%";
		quiz[12][5]="23%";

		quiz[13][0]="လူ႔ခႏၶာကိုယ္႐ွိ အ ေသးငယ္ဆံုးေသာ အ႐ိုးမွာ - ";
		quiz[13][1]="ေျခဖဝါး႐ိုး";
		quiz[13][2]="နား႐ိုး";
		quiz[13][3]="လက္ေခ်ာင္း႐ိုး";
		quiz[13][4]="ႏွာေခါင္း႐ိုး";
		quiz[13][5]="နား႐ိုး";

		quiz[14][0]="လူ႔ခႏၶာကိုယ္႐ွိ အႀကီးဆံုး ကိုယ္ခႏၶာအစိတ္အပိုင္းမွာ";
		quiz[14][1]="ဦးေႏွာက္";
		quiz[14][2]="ႏွလံုး";
		quiz[14][3]="တင္ပါး";
		quiz[14][4]="အ ေရျပား";
		quiz[14][5]="အ ေရျပား";

		quiz[15][0]="လူႀကီးမ်ား သူငယ္ျပန္ေနစဥ္တ ြင္ ဓာတ္စာအျဖစ္ မွီဝဲသင့္ေသာ အဆီတစ္မ်ိဳးမွာ -";
		quiz[15][1]="ပဲဆီ";
		quiz[15][2]="သံလ ြင္ဆီ";
		quiz[15][3]="ႏွမ္းဆီ";
		quiz[15][4]="ငါးႀကီးဆီ";
		quiz[15][5]="ငါးႀကီးဆီ";

		quiz[16][0]="နႏြင္းသည္ ----------- ႐ွိ အဆိပ္ အ ေတာက္မ်ားကိုဖယ္႐ွားေပးႏိုင္ေသာ အစ ြမ္းသတၱိ႐ွိပါသည္။";
		quiz[16][1]="အသည္း";
		quiz[16][2]="အဆုတ္";
		quiz[16][3]="ႏွလံုး";
		quiz[16][4]="သရက္ရ ြက္";
		quiz[16][5]="အသည္း";

		quiz[17][0]="အစာအိမ္ေရာဂါေဝဒနာ႐ွင္မ်ား အတ ြက္ အထူးသင့္ေလ်ာ္ေသာ အစားအစာတစ္မ်ိဳးမွာ";
		quiz[17][1]="ဒိန္ခ်ဥ္";
		quiz[17][2]="ႏြားႏို႔";
		quiz[17][3]="ေကာက္ညႇင္းေပါင္း";
		quiz[17][4]="မာလာ႐ွမ္းေကာ";
		quiz[17][5]="ႏြားႏို႔";

		quiz[18][0]="Bacteria ပိုးမႊားမ်ားမွတစ္ဆင့္ ကူးစက္ႏုိင္ေသာေရာဂါမွာ -";
		quiz[18][1]="ရာသီတုပ္ ေက ြး";
		quiz[18][2]="ပိုလီယို";
		quiz[18][3]="တီဘီေရာဂါ";
		quiz[18][4]="အ႐ိုးပ ြျခင္း";
		quiz[18][5]="တီဘီေရာဂါ";

		quiz[19][0]="လူတစ္ဦးသည္ ပ်မ္းမွ်အားျဖင့္ တစ္ေန႔လွ်င္ ေရ ---------- ခန္႔ေသာက္သင့္ပါသည္။";
		quiz[19][1]="6 လီတာ";
		quiz[19][2]="7 လီတာ";
		quiz[19][3]="8 လီတာ";
		quiz[19][4]="9 လီတာ";
		quiz[19][5]="8 လီတာ";

		quiz[20][0]="ေအာက္ပါတို႔မွ ဂလူးကို႔စ္ဓာတ္ပါဝင္ေသာ အစားအစာမွာ -";
		quiz[20][1]="ပဲပလာတာ";
		quiz[20][2]="ေခါက္ဆဲ ြ ေၾကာ္";
		quiz[20][3]="ၾကက္ဥ";
		quiz[20][4]="ငါး";
		quiz[20][5]="ေခါက္ဆဲ ြ ေၾကာ္";

		quiz[21][0]="ဆီးခ်ိဳေရာဂါ၏ လကၡဏာမဟုတ္ေသာ အခ်က္ကို ေ ရ ြးပါ။";
		quiz[21][1]="စိတ္ဆႏၵျပင္းျပျခင္း";
		quiz[21][2]="ဆီးအလ ြန္သ ြားျခင္း";
		quiz[21][3]="ၾက ြက္သားမ်ား နာက်င္ကိုက္ခဲျခင္း";
		quiz[21][4]="အ ေရျပားမ်ား ယားယံျခင္း";
		quiz[21][5]="ၾက ြက္သားမ်ား နာက်င္ကိုက္ခဲျခင္း";

		quiz[22][0]="အသက္ ------- ႏွင့္အထက္ အမ်ိဳးသမီးမ်ားသည္ အသိဥာဏ္ မဖံ ြ ့ၿဖိဳ း ေသာ က ေလး ေမ ြးဖ ြားႏိုင္ ေျခမ်ားျပားသည္။";
		quiz[22][1]="42 ႏွစ္";
		quiz[22][2]="46 ႏွစ္";
		quiz[22][3]="50 ႏွစ္";
		quiz[22][4]="53 ႏွစ္";
		quiz[22][5]="46 ႏွစ္";

		quiz[23][0]="လူတစ္ဦး၏ ႏွလံုးတ ြင္ အခန္းမည္မွ်႐ွိသနည္း။";
		quiz[23][1]="1 ခန္း";
		quiz[23][2]="2 ခန္း";
		quiz[23][3]="3 ခန္း";
		quiz[23][4]="4 ခန္း";
		quiz[23][5]="4 ခန္း";

		quiz[24][0]="ေန ေရာင္ျခည္တ ြင္ပါဝင္ေသာ ------- ႏွင့္ -------- တို႔သည္ အ ေရျပားကင္ဆာျဖစ္ေစႏိုင္ပါသည္။";
		quiz[24][1]="UVA, UVB";
		quiz[24][2]="UVA, SPF";
		quiz[24][3]="UVB, PA++";
		quiz[24][4]="SPF, PA++";
		quiz[24][5]="UVA, UVB";

		quiz[25][0]="သ ြားႏွင့္ခံတ ြင္း က်န္းမာေရးခ်ိဳ႕တဲ့ေနသူမ်ားသည္ ---------တစ္ႀကိမ္ ဆရာဝန္၏ စစ္ေဆးမႈ ခံယူသင့္ပါသည္။";
		quiz[25][1]="3 လ";
		quiz[25][2]="5 လ";
		quiz[25][3]="6 လ";
		quiz[25][4]="9 လ";
		quiz[25][5]="6 လ";

		quiz[26][0]="ေက်ာက္ကပ္က်န္းမာေရး ခ်ိဳ႕ယ ြင္းေနပါက ေအာက္ပါတို႔မွ မည္သည့္ အစားအစာကို ေ႐ွာင္ၾကဥ္သင့္သနည္း။";
		quiz[26][1]="ဘဲဥ";
		quiz[26][2]="ဝက္ကလီစာ";
		quiz[26][3]="ငွက္ေပ်ာသီး";
		quiz[26][4]="ဂဏန္း";
		quiz[26][5]="ဝက္ကလီစာ";

		quiz[27][0]="ေအာက္ပါတို႔မွ ယွဥ္တဲ ြစားသံုးရန္မသင့္ေသာ အစားအစာႏွစ္မ်ိဳးကိုေရ ြးပါ။";
		quiz[27][1]="ဘဲဥႏွင့္ဖရဲသီး";
		quiz[27][2]="ၾကက္ဥႏွင့္ဖရဲသီး";
		quiz[27][3]="ငံုးဥႏွင့္ဖရဲသီး";
		quiz[27][4]="ငါးဥႏွင့္ဖရဲသီး";
		quiz[27][5]="ဘဲဥႏွင့္ဖရဲသီး";

		quiz[28][0]="ေအာက္ပါတို႔မွ ယွဥ္တဲ ြစားသံုးရန္မသင့္ေသာ အစားအစာႏွစ္မ်ိဳးကိုေရ ြးပါ။";
		quiz[28][1]="သိုးသားႏွင့္သံပုရာသီး";
		quiz[28][2]="ခိုသားႏွင့္ေၾကာင္လွ်ာသီး";
		quiz[28][3]="ၾကက္ဥႏွင့္ေၾကာင္လွ်ာသီး";
		quiz[28][4]="ၾကက္သားႏွင့္ေၾကာင္လွ်ာသီး";
		quiz[28][5]="ၾကက္သားႏွင့္ေၾကာင္လွ်ာသီး";

		quiz[29][0]="ေအာက္ပါတို႔မွ ယွဥ္တဲ ြစားသံုးရန္မသင့္ေသာ အစားအစာႏွစ္မ်ိဳးကိုေရ ြးပါ။";
		quiz[29][1]="အုန္းႏို႔ ေခါက္ဆဲ ြႏွင့္ Pepsi";
		quiz[29][2]="႐ွမ္းေခါက္ဆဲ ြႏွင့္ Coca Cola";
		quiz[29][3]="မုန္႔ဟင္းခါးႏွင့္ Sunkist";
		quiz[29][4]="ဆီခ်က္ေခါက္ဆြဲႏွင့္ Coca Cola";
		quiz[29][5]="ဆီခ်က္ေခါက္ဆဲ ြႏွင့္ Pepsi";

		quiz[30][0]="ေသ ြးတိုးေရာဂါေဝဒနာခံစားေနရပါက ေ႐ွာင္ၾကဥ္ရမည့္အခ်က္မွာ - ";
		quiz[30][1]="ေဆးလိပ္ေသာက္ျခင္း";
		quiz[30][2]="ငွက္ေပ်ာသီးစားျခင္း";
		quiz[30][3]="အခံ ြမာသီးမ်ားစားျခင္း";
		quiz[30][4]="ေရခ်ိဳငါးမ်ိဳးစံုစားျခင္း";
		quiz[30][5]="ေဆးလိပ္ေသာက္ျခင္း";

		quiz[31][0]="ဆီးခ်ိဳေရာဂါေဝဒနာ႐ွင္မ်ား လိုက္နာ ေဆာင္ရ ြက္ရမည့္အခ်က္မွာ-";
		quiz[31][1]="ေကာက္ညႇင္း, ဆန္ႏွင့္ ဂ်ံဳတို႔ျဖင့္ျပဳလုပ္ထားေသာ မုန္႔မ်ားစားျခင္း";
		quiz[31][2]="အခ်ိဳဓာတ္မ်ားေသာ အစားအစာမ်ား စားသံုးျခင္း";
		quiz[31][3]="အသင့္စား ေခါက္ဆဲ ြ ေျခာက္မ်ားစားသံုးျခင္း";
		quiz[31][4]="အရည္ရႊမ္းေသာ အသီးမ်ားစားသံုးျခင္း";
		quiz[31][5]="အရည္ရႊမ္းေသာ အသီးမ်ားစားသံုးျခင္း";

		quiz[32][0]="လူတစ္ဦး၏ ပံုမွန္ေသ ြးေပါင္ခ်ိန္မွာ အ ေပၚ ေသ ြး --------- ႏွင့္  ေအာက္ ေသ ြး --------- ျဖစ္ပါသည္။";
		quiz[32][1]="120, 90";
		quiz[32][2]="120,80";
		quiz[32][3]="110, 80";
		quiz[32][4]="130, 90";
		quiz[32][5]="120,80";

		quiz[33][0]="အ႐ိုးက်န္းမာေစရန္ လုပ္ေဆာင္သင့္ေသာအခ်က္မွာ -";
		quiz[33][1]="ေန႔စဥ္ႏြားႏို္႔တစ္ခ ြက္ ေသာက္ျခင္း";
		quiz[33][2]="ေန႔စဥ္သံပုရာရည္တစ္ခ ြက္ ေသာက္ျခင္း";
		quiz[33][3]="အနီေရာင္႐ွိေသာ အသားမ်ားစားျခင္း";
		quiz[33][4]="ပဲမ်ိဳးစံု စားသံုးျခင္း";
		quiz[33][5]="ေန႔စဥ္ႏြားႏို္႔တစ္ခ ြက္ ေသာက္ျခင္း";

		quiz[34][0]="AIDS ေရာဂါကို ျဖစ္ေပၚ ေစေသာ ေရာဂါပိုးမွာ ----------- ျဖစ္ပါသည္။";
		quiz[34][1]="အီဘိုလာ";
		quiz[34][2]="အယ္လ္ဇိုင္းမား";
		quiz[34][3]="TB";
		quiz[34][4]="HIV";
		quiz[34][5]="HIV";

		quiz[35][0]="ေအာက္ပါတို႔မွ မည္သည္ကိုစားသံုးမိပါက အူအတက္ေပါက္ႏိုင္ပါသနည္း။";
		quiz[35][1]="အစာေခ်ရန္ခက္ခဲေသာ အစားအစာမ်ား";
		quiz[35][2]="အလ ြန္စပ္ေသာ အစားအစာမ်ား";
		quiz[35][3]="အသင့္စား ေခါက္ဆဲ ြထုပ္မ်ား";
		quiz[35][4]="အခ်ဥ္ေဖာက္ထားေသာ အစားအစာမ်ား";
		quiz[35][5]="အစာေခ်ရန္ခက္ခဲေသာ အစားအစာမ်ား";

		quiz[36][0]="ေခ ြးကိုက္ခံရပါက -------------------- ကိုျဖစ္ပ ြားေစႏိုင္ပါသည္။";
		quiz[36][1]="ဝက္႐ူးျပန္ေရာဂါ";
		quiz[36][2]="ေခ ြး႐ူးျပန္ေရာဂါ";
		quiz[36][3]="ငွက္ဖ်ားေရာဂါ";
		quiz[36][4]="ေသ ြးလ ြန္တုပ္ေက ြးေရာဂါ";
		quiz[36][5]="ေခ ြး႐ူးျပန္ေရာဂါ";

		quiz[37][0]="ဝမ္းပ်က္ဝမ္းေလွ်ာေသာအခါ လူ႔ခႏၶာကိုယ္မွ မည္သည့္အရာကို အမ်ားဆံုး ဆံုး႐ွံု းပါသနည္း။";
		quiz[37][1]="သံဓာတ္";
		quiz[37][2]="ေသ ြးျဖဴ ဥ";
		quiz[37][3]="ေရဓာတ္";
		quiz[37][4]="အသားဓာတ္";
		quiz[37][5]="ေရဓာတ္";

		quiz[38][0]="ႏွာေခ်ျခင္းေၾကာင့္ မည္သည့္ကိုယ္ခႏၶာ အစိတ္အပိုင္းတ ြင္ နာက်င္မႈျဖစ္ေပၚႏိုင္ပါသနည္း။";
		quiz[38][1]="အူမႀကီး";
		quiz[38][2]="ႏွလံုး";
		quiz[38][3]="အဆုတ္";
		quiz[38][4]="လည္ေခ်ာင္း";
		quiz[38][5]="ႏွလံုး";

		quiz[39][0]="ပ်ားရည္ႏွင့္တဲ ြမစားသင့္ေသာ အရာမွာ ---------- ျဖစ္ပါသည္။";
		quiz[39][1]="သၾကား";
		quiz[39][2]="ထန္းလ်က္";
		quiz[39][3]="လက္ဖက္";
		quiz[39][4]="ေျမပဲ";
		quiz[39][5]="လက္ဖက္";
	}
	
	
	
	}
